//Задача 2: Замена заглавных букв на строчные в строке
public class Task2
{
    public static void Main(string[] args)
    {
        string input = "aBcD1ef!-";
        string result = input.ToLower();
        Console.WriteLine(result);
    }
}